src/БиблиотекаИнструментовРазработки/src/Catalogs/бир_ЗапросыКДанным/бир_ЗапросыКДанным.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>бир_ЗапросыКДанным</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Ид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Запрос</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/БиблиотекаИнструментовРазработки/src/Catalogs/бир_ЗапросыКДанным/ObjectModule.bsl
#Область ОписаниеПеременных

Перем ПреобразованиеДанных;          // ОбработкаОбъект   - обработка преобразования данных
Перем ПроцессорЗапросов;             // ОбработкаОбъект   - обработка - процессор запросов

#КонецОбласти // ОписаниеПеременных

#Область ПрограммныйИнтерфейс

// Функция - возвращает описание текущего объекта запроса
//
// Параметры:
//   Поля    - Строка                 - список добавляемых в описание полей (строка разделенная "," или массив)
//             Массив из Строка         поля Ид и Наименование возвращаются всегда
//                                      возможные поля: Поля, Параметры, Описание, ТекстЗапроса
//
// Возвращаемое значение:
//   Массив из Структура                         - описание текущего объекта запроса
//                                                 состав полей указазывается в параметре "Поля"
//     *Ид                 - Строка                - идентификатор запроса
//     *Код                - Строка                - код элемента справочника запросов
//     *Наименование       - Строка                - наименование запроса
//     *Родитель           - СправочникОбъект      - родительская группа справочника запросов
//                           .бир_ЗапросыКДанным
//     *Предопределенный   - Булево                - флаг предопределенного элемента справочника
//     *ПометкаУдаления    - Булево                - пометка удаления
//     *Описание           - Строка                - описание запроса
//     *ТекстЗапроса       - Строка                - текст запроса
//     *Поля               - Массив из Структура   - описание полей запроса (см. Поля())
//     *Параметры          - Массив из Структура   - описание параметров запроса (см. Параметры())
//
Функция Описание(Знач Поля = "") Экспорт
	
	Если НЕ ЗначениеЗаполнено(Поля) Тогда
		Поля = Новый Массив();
	КонецЕсли;
	Если ТипЗнч(Поля) = Тип("Строка") Тогда
		Поля = СтрРазделить(Поля, ",", Ложь);
	КонецЕсли;
	Для й = 0 По Поля.ВГраница() Цикл
		Поля[й] = СокрЛП(Поля[й]);
	КонецЦикла;
	
	ОписаниеЗапроса = Новый Структура();
	ОписаниеЗапроса.Вставить("Ид"          , ЭтотОбъект.Ид);
	ОписаниеЗапроса.Вставить("Наименование", ЭтотОбъект.Наименование);
	
	Для Каждого ТекПоле Из Поля Цикл 
		Если ОписаниеЗапроса.Свойство(ТекПоле) Тогда
			Продолжить;
		КонецЕсли;
		Если ЭтотОбъект.Метаданные().Реквизиты.Найти(ТекПоле) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ОписаниеЗапроса.Вставить(ТекПоле, ЭтотОбъект[ТекПоле]);
	КонецЦикла;
	Если НЕ Поля.Найти("ТекстЗапроса") = Неопределено Тогда
		ОписаниеЗапроса.Вставить("ТекстЗапроса", ПроцессорЗапросов().ТекстЗапроса());
	КонецЕсли;
	Если НЕ Поля.Найти("Поля") = Неопределено Тогда
		ОписаниеЗапроса.Вставить("Поля", Поля());
	КонецЕсли;
	Если НЕ Поля.Найти("Параметры") = Неопределено Тогда
		ОписаниеЗапроса.Вставить("Параметры", Параметры(Истина));
	КонецЕсли;

	Возврат ОписаниеЗапроса;
	
КонецФункции // Описание()

// Функция - возвращает поля запроса, возвращающего данные для текущего объекта запроса
//
// Параметры:
//   НомерЗапросаПакета    - Число    - номер запроса в пакете, для которого требуется получить поля
//                                      если не указано, то возвращаются поля последнего запроса
//                                      используется сквозная нумерация запросов в пакете
//                                      с учетом запросов на создание/уничтожение временных таблиц
//
// Возвращаемое значение:
//   Массив из Структура                          - параметры запроса для текущего объекта запроса
//     *Имя                      - Строка           - псевдоним поля в запросе
//     *ТипЗначения              - ОписаниеТипов    - тип значения поля если удалось вычислить
//
Функция Поля(НомерЗапросаПакета = Неопределено) Экспорт

	Поля = Новый Массив();

	Попытка
		Схема = Схема();
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка получения полей запроса:%1%2", Символы.ПС, ТекстОшибки);
		Возврат ТекстОшибки;
	КонецПопытки;

	Номер = 0;
	Запрос = Неопределено;

	Для Каждого ТекЗапрос Из Схема.ПакетЗапросов Цикл
		
		Если ТипЗнч(ТекЗапрос) = Тип("ЗапросУничтоженияТаблицыСхемыЗапроса") Тогда
			Номер = Номер + 1;
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекЗапрос.ТаблицаДляПомещения) Тогда
			Номер = Номер + 1;
			Продолжить;
		КонецЕсли;
		
		Запрос = ТекЗапрос;
		Если Номер = НомерЗапросаПакета Тогда
			Прервать;
		КонецЕсли;
		Номер = Номер + 1;
	КонецЦикла;

	Если ТипЗнч(Запрос) = Тип("ЗапросВыбораСхемыЗапроса") Тогда
		Для Каждого ТекПоле Из Запрос.Колонки Цикл
			Поле = Новый Структура();
			Поле.Вставить("Имя"        , ТекПоле.Псевдоним);
			Поле.Вставить("ТипЗначения", ТекПоле.ТипЗначения);
			Поля.Добавить(Поле);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Поля;

КонецФункции // Поля()

// Функция - возвращает параметры запроса для текущего объекта запроса
//
// Параметры:
//   ЗаполнитьЗначения    - Булево    - Истина - вычислить значения параметров
//
// Возвращаемое значение:
//   Массив из Структура                - параметры запроса для текущего объекта запроса
//     *Имя            - Строка           - имя параметра
//     *ТипЗначения    - ОписаниеТипов    - тип значения параметра
//
Функция Параметры(ЗаполнитьЗначения = Ложь) Экспорт

	Параметры = Новый Массив();

	Попытка
		Схема = Схема();
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат СтрШаблон("Ошибка получения параметров запроса:%1%2",
		                   Символы.ПС,
		                   ТекстОшибки);
	КонецПопытки;
	
	НайденныеПараметры = Схема.НайтиПараметры();
	
	ПараметрыПоУмолчанию = ПроцессорЗапросов().ПараметрыЗапроса();

	ДобавленныеПараметры = Новый Соответствие();

	Для Каждого ТекПараметр Из НайденныеПараметры Цикл
		Параметр = Новый Структура();
		Параметр.Вставить("Имя", ТекПараметр.Имя);
		Параметр.Вставить("Тип", ТекПараметр.ТипЗначения);
		Параметр.Вставить("ЕстьВЗапросе", Истина);
		Параметр.Вставить("Значение");

		Если ЗаполнитьЗначения И ПараметрыПоУмолчанию.Свойство(ТекПараметр.Имя) Тогда
			Если ПараметрыПоУмолчанию[ТекПараметр.Имя].Выражение Тогда
				Параметр.Значение = ПроцессорЗапросов().ВычислитьВыражение(ПараметрыПоУмолчанию[ТекПараметр.Имя].Значение);
			Иначе
				Параметр.Значение = ПараметрыПоУмолчанию[ТекПараметр.Имя].Значение; 
			КонецЕсли;
		КонецЕсли;

		ДобавленныеПараметры.Вставить(ТекПараметр.Имя, Истина);
		Параметры.Добавить(Параметр);
	КонецЦикла;

	Для Каждого ТекПараметр Из ПараметрыПоУмолчанию Цикл
		Если ДобавленныеПараметры.Получить(ТекПараметр.Ключ) = Истина Тогда
			Продолжить;
		КонецЕсли;
		Параметр = Новый Структура();
		Параметр.Вставить("Имя", ТекПараметр.Ключ);
		Параметр.Вставить("Тип");
		Параметр.Вставить("ЕстьВЗапросе", Ложь);
		Параметр.Вставить("Значение");

		Если ЗаполнитьЗначения Тогда
			Если ТекПараметр.Значение.Выражение Тогда
				Параметр.Значение = ПроцессорЗапросов().ВычислитьВыражение(ТекПараметр.Значение.Значение);
			Иначе
				Параметр.Значение = ТекПараметр.Значение.Значение; 
			КонецЕсли;
		КонецЕсли;

		Параметры.Добавить(Параметр);
	КонецЦикла;

	Возврат Параметры;

КонецФункции // Параметры()

// Функция - возвращает схему запроса для текущего объекта запроса
//
// Возвращаемое значение:
//   СхемаЗапроса    - схема запроса для текущего объекта запроса
//
Функция Схема() Экспорт

	Схема = Новый СхемаЗапроса();
	Попытка
		Схема.УстановитьТекстЗапроса(ПроцессорЗапросов().ТекстЗапроса());
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка получения схемы запроса ""%1"":%2%3",
		                        ЭтотОбъект.Наименование,
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

	Возврат Схема;

КонецФункции // Схема()

// Функция - возвращает схему компоновки данных для текущего объекта запроса
//
// Возвращаемое значение:
//   СхемаКомпоновкиДанных    - схема компоновки данных для текущего объекта запроса
//
Функция СхемаКомпоновкиДанных() Экспорт

	Схема = Новый СхемаКомпоновкиДанных();
	ИсточникДанных = Схема.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = ЭтотОбъект.Ид;
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанных = Схема.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя                                        = ЭтотОбъект.Ид;
	НаборДанных.ИсточникДанных                             = ЭтотОбъект.Ид;
	НаборДанных.АвтоЗаполнениеДоступныхПолей               = Истина;
	НаборДанных.ИспользоватьГруппировкиЗапросаЕслиВозможно = Истина;
	НаборДанных.Запрос                                     = ПроцессорЗапросов().ТекстЗапроса();

	Поля = Поля();

	Для Каждого ТекПоле Из Поля Цикл
		Поле = НаборДанных.Поля.Найти(ТекПоле.Имя);
		Если Поле = Неопределено Тогда
			Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		КонецЕсли;
		Поле.Поле        = ТекПоле.Имя;
		Поле.ПутьКДанным = ТекПоле.Имя;
		Поле.ТипЗначения = ТекПоле.ТипЗначения;
	КонецЦикла;

	Вариант = Схема.ВариантыНастроек.Найти("Основной");    
	Вариант.Настройки.Структура.Очистить();
	Если НЕ Вариант = Неопределено Тогда
		ГруппировкаНастроек = Вариант.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		Поле = ГруппировкаНастроек.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	КонецЕсли;

	Возврат Схема;

КонецФункции // СхемаКомпоновкиДанных()

// Функция - возвращает настройки компоновки данных для текущего объекта запроса
//
// Параметры:
//   Параметры    - Структура    - значения параметров запроса
//
// Возвращаемое значение:
//   НастройкиКомпоновкиДанных    - настройки компоновки данных для текущего объекта запроса
//
Функция НастройкиКомпоновкиДанных(Знач Параметры = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(Параметры) Тогда
		Параметры = Новый Структура();
	КонецЕсли;

	Схема = СхемаКомпоновкиДанных();
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема));
	КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
	Для Каждого Элемент Из КомпоновщикНастроек.Настройки.Выбор.ДоступныеПоляВыбора.Элементы Цикл
		Если Элемент.Папка Тогда
			Продолжить;
		КонецЕсли;
		ВыбранноеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Использование = Истина;
		ВыбранноеПоле.Поле = Элемент.Поле;
	КонецЦикла;

	ГруппировкаНастроек = КомпоновщикНастроек.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Поле = ГруппировкаНастроек.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));

	Для Каждого ТекЭлемент Из Параметры Цикл
		Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(ТекЭлемент.Ключ);
		Если Параметр = Неопределено Тогда
			Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Добавить();
		КонецЕсли;
		Параметр.Использование = Истина;
		Параметр.Параметр = Новый ПараметрКомпоновкиДанных(ТекЭлемент.Ключ);
		Параметр.Значение = ТекЭлемент.Значение;
	КонецЦикла;
	
	Возврат КомпоновщикНастроек.ПолучитьНастройки();

КонецФункции // НастройкиКомпоновкиДанных()

// Функция - возвращает макет компоновки данных
//
// Параметры:
//   Настройки      - НастройкиКомпоновкиДанных  - настройки компоновки данных
//   Параметры      - Структура                  - значения параметров запроса
//   ТипГенератора  - Тип                        - тип генератора макета компоновки данных
//                                                 Тип("ГенераторМакетаКомпоновкиДанных") или
//                                                 Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")
//
// Возвращаемое значение:
//   МакетКомпоновкиДанных    - макет компоновки данных для текущего объекта запроса
//
Функция МакетКомпоновкиДанных(Знач Настройки = Неопределено,
                              Знач Параметры = Неопределено,
							  Знач ТипГенератора = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(ТипГенератора) Тогда
		ТипГенератора = Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений");
	КонецЕсли;

	Схема = СхемаКомпоновкиДанных();
	Если Настройки = Неопределено Тогда
		Настройки = НастройкиКомпоновкиДанных(Параметры);
	КонецЕсли;

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();

	Возврат КомпоновщикМакета.Выполнить(Схема, Настройки, , , ТипГенератора);

КонецФункции // НастройкиКомпоновкиДанных()

// Функция - возвращает обработку-процессор запросов
//
// Параметры:
//   Ид           - Строка,               - идентификатор запроса или ссылка на элемент справочника
//                  СправочникСсылка
//                  .бир_ЗапросыКДанным
//   ПоУмолчанию  - Булево                - Истина - получить процессор запросов со значениями параметров по умолчанию;
//                                          Ложь - получить ранее инициализированный процессор запросов
//
// Возвращаемое значение:
//   ОбработкаОбъект           - обработка-процессор запросов
//   .бир_ПроцессорЗапросов
//
Функция ПроцессорЗапросов(ПоУмолчанию = Ложь) Экспорт

	Если ПроцессорЗапросов = Неопределено ИЛИ ПоУмолчанию Тогда
		ПроцессорЗапросов = Обработки.бир_ПроцессорЗапросов.Создать();
		
		ЗапросСПараметрами = ПреобразованиеДанных().ПрочитатьОписаниеОбъектаИзJSON(ЭтотОбъект.Запрос);
		ЗапросСПараметрами = ПреобразованиеДанных().ЗначениеИзСтруктуры(ЗапросСПараметрами);
		
		ПроцессорЗапросов.УстановитьТекстЗапроса(ЗапросСПараметрами.Запрос_Текст);
		ПроцессорЗапросов.УстановитьПараметрыЗапроса(ЗапросСПараметрами.Запрос_Параметры);
		ПроцессорЗапросов.УстановитьПроизвольныеВыражения(ЗапросСПараметрами.ПроизвольныеВыражения);
	КонецЕсли;

	Возврат ПроцессорЗапросов; 

КонецФункции // ПроцессорЗапросов()

// Функция - выполняет запрос и возвращает полученный результат
//
// Параметры:
//   Макет            - МакетКомпоновкиДанных  - макет компоновки данных
//   Параметры        - Структура              - значения параметров запроса
//   ТаблицаЗначений  - Булево                 - Истина (по умолчанию) - вывод в таблицу значений
//                                               Ложь - вывод в табличный документ
//
// Возвращаемое значение:
//   ТаблицаЗначений    - результат запроса для текущего объекта запроса
//   ТабличныйДокумент
//
Функция Данные(Знач Макет, Знач Параметры = Неопределено, Знач ТаблицаЗначений = Истина) Экспорт

	Если Макет = Неопределено Тогда
		Макет = МакетКомпоновкиДанных(Параметры);
	КонецЕсли;
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных();
	ПроцессорКомпоновки.Инициализировать(Макет);

	Если ТаблицаЗначений Тогда
		ПроцессорВыводаРезультатаКомпоновки = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
	Иначе
		ПроцессорВыводаРезультатаКомпоновки = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент();
	КонецЕсли;

	Возврат ПроцессорВыводаРезультатаКомпоновки.Вывести(ПроцессорКомпоновки);

КонецФункции // Данные()

Функция ТекстЗапроса(ТекстЗапроса) Экспорт
	
	Возврат ПроцессорЗапросов(Истина).ТекстЗапроса();

КонецФункции // ТекстЗапроса()

Процедура УстановитьТекстЗапроса(ТекстЗапроса) Экспорт
	
	ЗапросСПараметрами = Неопределено;
	
	Попытка
		ЗапросСПараметрами = ПреобразованиеДанных().ПрочитатьОписаниеОбъектаИзJSON(ЭтотОбъект.Запрос);
		ЗапросСПараметрами = ПреобразованиеДанных().ЗначениеИзСтруктуры(ЗапросСПараметрами);
	Исключение
		ЗапросСПараметрами = Новый Структура("Запрос_Текст,
		                                     |Запрос_Параметры,
											 |ПроизвольныеВыражения",
		                                     "",
		                                     Новый Массив(),
		                                     Новый Массив());
	КонецПопытки;

	ЗапросСПараметрами.Запрос_Текст = ТекстЗапроса;
	ЗапросСПараметрами = ПреобразованиеДанных().ЗначениеВСтруктуру(ЗапросСПараметрами);	
	ЭтотОбъект.Запрос = ПреобразованиеДанных().ЗаписатьОписаниеОбъектаВJSON(ЗапросСПараметрами);

КонецПроцедуры // УстановитьТекстЗапроса()

#КонецОбласти // ПрограммныйИнтерфейс

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)

	ЭтотОбъект.Ид = Справочники.бир_ЗапросыКДанным.НовыйИдентификаторЗапроса(ЭтотОбъект.Наименование, ЭтотОбъект.Ссылка);

КонецПроцедуры // ПриКопировании()

Процедура ПередЗаписью(Отказ)
  
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Ид) Тогда
		ЭтотОбъект.Ид = Справочники.бир_ЗапросыКДанным.НовыйИдентификаторЗапроса(ЭтотОбъект.Наименование, ЭтотОбъект.Ссылка);
	КонецЕсли;
	
	ОписаниеИд = Справочники.бир_ЗапросыКДанным.ПроверитьИдентификаторЗапроса(ЭтотОбъект.Ид, ЭтотОбъект.Ссылка);

	Если НЕ (ОписаниеИд.Валиден И ОписаниеИд.Свободен) Тогда
		Для Каждого ТекОшибка Из ОписаниеИд.Ошибки Цикл
			ОбщегоНазначения.СообщитьПользователю(ТекОшибка, ЭтотОбъект.Ссылка, , "Объект.Ид", Отказ);
		КонецЦикла;
	КонецЕсли;
    
КонецПроцедуры // ПередЗаписью()

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

// Функция - Получает обработку сериализации значений
// 
// Возвращаемое значение:
//   ОбработкаОбъект    - обработка преобразования данных
//
Функция ПреобразованиеДанных()

	Если ПреобразованиеДанных = Неопределено Тогда
		ПреобразованиеДанных = Обработки.бир_ПреобразованиеДанных.Создать();
	КонецЕсли;

	Возврат ПреобразованиеДанных; 

КонецФункции // ПреобразованиеДанных()

#КонецОбласти // СлужебныеПроцедурыИФункции
